#include "headfile.h"
// 此文件包含了所有的中断服务函数

//定时器中断服务函数
int count = 0;
uint8_t state = 0;
void TA0_N_IRQHandler() // TIMER_A0
{
	if(TIMER_A0->CTL&1)
	{
		//此处编写中断代码
		count ++;
		if(count == 20) 
		{
			gpio_set(P_2,Pin_0,state);
			state++;
			state = state%2;
			
			count = 0;
		}
		TIMER_A0->CTL &= ~1;  //清除中断标志位
	}

}

void TA1_N_IRQHandler() // TIMER_A1
{
	if(TIMER_A1->CTL&1)
	{

		//此处编写中断代码
		TIMER_A1->CTL &= ~1;  //清除中断标志位
	}

}

void TA2_N_IRQHandler() // TIMER_A2
{
	if(TIMER_A2->CTL&1)
	{
		
		//此处编写中断代码
		TIMER_A2->CTL &= ~1;  //清除中断标志位
	}

}

void TA3_N_IRQHandler() // TIMER_A3
{
	if(TIMER_A3->CTL&1)
	{

		//此处编写中断代码
		TIMER_A3->CTL &= ~1;  //清除中断标志位
	}

}

//串口中断服务函数
void EUSCIA0_IRQHandler() // UART_0
{
	
	if(EUSCI_A0->IFG&1)
	{
		//此处编写中断代码
		EUSCI_A0->IFG &= ~1; //清除中断标志位
	}

}

void EUSCIA1_IRQHandler() // UART_1
{
	
	if(EUSCI_A1->IFG&1)
	{
		//此处编写中断代码
		EUSCI_A1->IFG &= ~1; //清除中断标志位
	}

}

void EUSCIA2_IRQHandler() // UART_2
{
	
	if(EUSCI_A2->IFG&1)
	{

		//此处编写中断代码
		EUSCI_A2->IFG &= ~1; //清除中断标志位
	}

}

void EUSCIA3_IRQHandler() // UART_3
{
	
	if(EUSCI_A3->IFG&1)
	{

		//此处编写中断代码
		EUSCI_A3->IFG &= ~1; //清除中断标志位
	}

}


//外部中断服务函数
void PORT1_IRQHandler()
{
	
	if(P1->IFG&(1<<0))         // P1.0外部中断
	{
		//此处编写中断代码
		P1->IFG &= ~(1<<0);  //清除中断标志位
	}
	
	if(P1->IFG&(1<<1))         // P1.1外部中断
	{
		//此处编写中断代码		
		P1->IFG &= ~(1<<1);  //清除中断标志位
	}

	if(P1->IFG&(1<<2))         // P1.2外部中断
	{
		//此处编写中断代码		
		P1->IFG &= ~(1<<2);  //清除中断标志位
	}
	
	if(P1->IFG&(1<<3))         // P1.3外部中断
	{
		//此处编写中断代码
		P1->IFG &= ~(1<<3);  //清除中断标志位
	}
	
	if(P1->IFG&(1<<4))         // P1.4外部中断
	{
		//此处编写中断代码
		P1->IFG &= ~(1<<4);  //清除中断标志位
	}
	
	if(P1->IFG&(1<<5))         // P1.5外部中断
	{
		//此处编写中断代码
		P1->IFG &= ~(1<<5);  //清除中断标志位
	}
	
	if(P1->IFG&(1<<6))         // P1.6外部中断
	{
		//此处编写中断代码		
		P1->IFG &= ~(1<<6);  //清除中断标志位
	}
	
	if(P1->IFG&(1<<7))         // P1.7外部中断
	{
		//此处编写中断代码		
		P1->IFG &= ~(1<<7);  //清除中断标志位
	}
}

void PORT2_IRQHandler()
{
	
	if(P2->IFG&(1<<0))         // P2.0外部中断
	{
		//此处编写中断代码
		P2->IFG &= ~(1<<0);  //清除中断标志位
	}
	
	if(P2->IFG&(1<<1))         // P2.1外部中断
	{
		//此处编写中断代码		
		P2->IFG &= ~(1<<1);  //清除中断标志位
	}

	if(P2->IFG&(1<<2))         // P2.2外部中断
	{
		//此处编写中断代码		
		P2->IFG &= ~(1<<2);  //清除中断标志位
	}
	
	if(P2->IFG&(1<<3))         // P2.3外部中断
	{
		//此处编写中断代码
		P2->IFG &= ~(1<<3);  //清除中断标志位
	}
	
	if(P2->IFG&(1<<4))         // P2.4外部中断
	{
		//此处编写中断代码
		P2->IFG &= ~(1<<4);  //清除中断标志位
	}
	
	if(P2->IFG&(1<<5))         // P2.5外部中断
	{
		//此处编写中断代码		
		P2->IFG &= ~(1<<5);  //清除中断标志位
	}
	
	if(P2->IFG&(1<<6))         // P2.6外部中断
	{
		//此处编写中断代码		
		P2->IFG &= ~(1<<6);  //清除中断标志位
	}
	
	if(P1->IFG&(1<<7))         // P2.7外部中断
	{
		//此处编写中断代码		
		P1->IFG &= ~(1<<7);  //清除中断标志位
	}
}

void PORT3_IRQHandler()
{
	
	if(P3->IFG&(1<<0))         // P3.0外部中断
	{
		//此处编写中断代码
		P3->IFG &= ~(1<<0);  //清除中断标志位
	}
	
	if(P3->IFG&(1<<1))         // P3.1外部中断
	{
		//此处编写中断代码		
		P3->IFG &= ~(1<<1);  //清除中断标志位
	}

	if(P3->IFG&(1<<2))         // P3.2外部中断
	{
		//此处编写中断代码		
		P3->IFG &= ~(1<<2);  //清除中断标志位
	}
	
	if(P3->IFG&(1<<3))         // P3.3外部中断
	{
		//此处编写中断代码
		P3->IFG &= ~(1<<3);  //清除中断标志位
	}
	
	if(P3->IFG&(1<<4))         // P3.4外部中断
	{
		//此处编写中断代码
		P3->IFG &= ~(1<<4);  //清除中断标志位
	}
	
	if(P3->IFG&(1<<5))         // P3.5外部中断
	{
		//此处编写中断代码	
		P3->IFG &= ~(1<<5);  //清除中断标志位
	}
	
	if(P3->IFG&(1<<6))         // P3.6外部中断
	{
		//此处编写中断代码		
		P3->IFG &= ~(1<<6);  //清除中断标志位
	}
	
	if(P3->IFG&(1<<7))         // P3.7外部中断
	{
		//此处编写中断代码		
		P3->IFG &= ~(1<<7);  //清除中断标志位
	}
}

void PORT4_IRQHandler()
{
	
	if(P4->IFG&(1<<0))         // P4.0外部中断
	{
		//此处编写中断代码
		P4->IFG &= ~(1<<0);  //清除中断标志位
	}
	
	if(P4->IFG&(1<<1))         // P4.1外部中断
	{
		//此处编写中断代码		
		P4->IFG &= ~(1<<1);  //清除中断标志位
	}

	if(P4->IFG&(1<<2))         // P4.2外部中断
	{
		//此处编写中断代码		
		P4->IFG &= ~(1<<2);  //清除中断标志位
	}
	
	if(P4->IFG&(1<<3))         // P4.3外部中断
	{
		//此处编写中断代码
		P4->IFG &= ~(1<<3);  //清除中断标志位
	}
	
	if(P4->IFG&(1<<4))         // P4.4外部中断
	{
		//此处编写中断代码
		P4->IFG &= ~(1<<4);  //清除中断标志位
	}
	
	if(P4->IFG&(1<<5))         // P4.5外部中断
	{
		//此处编写中断代码		
		P4->IFG &= ~(1<<5);  //清除中断标志位
	}
	
	if(P4->IFG&(1<<6))         // P4.6外部中断
	{
		//此处编写中断代码		
		P4->IFG &= ~(1<<6);  //清除中断标志位
	}
	
	if(P4->IFG&(1<<7))         // P4.7外部中断
	{
		//此处编写中断代码		
		P4->IFG &= ~(1<<7);  //清除中断标志位
	}
}

void PORT5_IRQHandler()
{
	
	if(P5->IFG&(1<<0))         // P5.0外部中断
	{
		//此处编写中断代码
		P5->IFG &= ~(1<<0);  //清除中断标志位
	}
	
	if(P5->IFG&(1<<1))         // P5.1外部中断
	{
		//此处编写中断代码		
		P5->IFG &= ~(1<<1);  //清除中断标志位
	}

	if(P5->IFG&(1<<2))         // P5.2外部中断
	{
		//此处编写中断代码
		P5->IFG &= ~(1<<2);  //清除中断标志位
	}
	
	if(P5->IFG&(1<<3))         // P5.3外部中断
	{
		//此处编写中断代码
		P5->IFG &= ~(1<<3);  //清除中断标志位
	}
	
	if(P5->IFG&(1<<4))         // P5.4外部中断
	{
		//此处编写中断代码
		P5->IFG &= ~(1<<4);  //清除中断标志位
	}
	
	if(P5->IFG&(1<<5))         // P5.5外部中断
	{
		//此处编写中断代码		
		P5->IFG &= ~(1<<5);  //清除中断标志位
	}
	
	if(P5->IFG&(1<<6))         // P5.6外部中断
	{
		//此处编写中断代码		
		P5->IFG &= ~(1<<6);  //清除中断标志位
	}
	
	if(P5->IFG&(1<<7))         // P5.7外部中断
	{
		//此处编写中断代码		
		P5->IFG &= ~(1<<7);  //清除中断标志位
	}
}

void PORT6_IRQHandler()
{
	
	if(P6->IFG&(1<<0))         // P6.0外部中断
	{
		//此处编写中断代码
		P6->IFG &= ~(1<<0);  //清除中断标志位
	}
	
	if(P6->IFG&(1<<1))         // P6.1外部中断
	{
		//此处编写中断代码		
		P6->IFG &= ~(1<<1);  //清除中断标志位
	}

	if(P6->IFG&(1<<2))         // P6.2外部中断
	{
		//此处编写中断代码		
		P6->IFG &= ~(1<<2);  //清除中断标志位
	}
	
	if(P6->IFG&(1<<3))         // P6.3外部中断
	{
		//此处编写中断代码
		P6->IFG &= ~(1<<3);  //清除中断标志位
	}
	
	if(P6->IFG&(1<<4))         // P6.4外部中断
	{
		//此处编写中断代码
		P6->IFG &= ~(1<<4);  //清除中断标志位
	}
	
	if(P6->IFG&(1<<5))         // P6.5外部中断
	{
		//此处编写中断代码		
		P6->IFG &= ~(1<<5);  //清除中断标志位
	}
	
	if(P6->IFG&(1<<6))         // P6.6外部中断
	{
		//此处编写中断代码		
		P6->IFG &= ~(1<<6);  //清除中断标志位
	}
	
	if(P6->IFG&(1<<7))         // P6.7外部中断
	{
		//此处编写中断代码		
		P6->IFG &= ~(1<<7);  //清除中断标志位
	}
}


void ADC14_IRQHandler()
{
	ADC_14.value = ADC14->MEM[0];
	ADC_14.conversion_end_flag = 1;
}
